#+TITLE: 八年级上数学错题
:PROPERTIES:
#+STARTUP: overview
#+STARTUP: noptag
#+STARTUP: hideblocks
#+OPTIONS: author:nil date:nil
#+TAGS: no_answer(a) \e error(p)
#+LATEX_CLASS: exam
#+LATEX_HEADER: \usepackage{xeCJK}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{polynom}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \usepackage{ulem}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{tkz-euclide}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{subfigure}
#+LATEX_HEADER: \usepackage{wrapfig}
#+LATEX_HEADER: \newcommand\epart{\part}
#+LATEX_HEADER: \newcommand\degree{^\circ}
#+LATEX_HEADER: \renewcommand{\solutiontitle}{\noindent\textbf{解：}\par\noindent}
#+LATEX_HEADER: \everymath{\displaystyle}
#+LATEX_CLASS_OPTIONS: [answers]

#+begin_src latex
\tikzset{
  dot/.style={
    circle, fill=black, inner sep=1pt, outer sep=0pt
  },
  dot label/.style={
    circle, inner sep=0pt, outer sep=1pt
  },
  % style for every pics named "right angle"
  pics/right angle/.append style={
    /tikz/draw, /tikz/angle radius=5pt
  }
}

%平行
\newcommand\pxx{%
\mathrel{\text{\tikz[baseline] \draw (0em,-0.3ex) -- (.4em,1.7ex) (.2em,-0.3ex) -- (.6em,1.7ex);}%
}}
#+end_src
:END:

*** 问答题 1
如图， $\triangle ABC$ 是边长为 $4$ 的等边三角形， $\triangle BCD$ 是顶角 $\angle BCD=120 \degree$ 的等腰三角形，
以 $D$ 为定点做一个 $60 \degree$ 的角，角的两边交 $AB$ , $AC$ 于 $M$ 、 $N$ 两点，连 $MN$ ，
求 $\triangle AMN$ 的周长?

#+name: pic.十每.1.base
#+begin_src latex :exports none
\coordinate (B) at (0, 0);
\coordinate (C) at (2.5, 0);
\coordinate (A) at ($(B)!1!60:(C)$);

\coordinate (D) at (intersection of B--$(B)!2!-30:(C)$
                                 and C--{$(C)!2!30:(B)$});

\coordinate (M) at (intersection of D--$(D)!1!45:(A)$
                                 and A--B);

\coordinate (N) at (intersection of D--$(D)!2!-60:(M)$ and C--A);

% 画线
\draw (A) -- (B) -- (C) -- cycle
(B) -- (D) -- (C)
(D) -- (M) -- (N) -- cycle
;

% 标点
\foreach \i/\angle in {A/90,B/-135,C/-45,D/-90,M/135,N/0} {
  \node[dot, label={[dot label]\angle:$\i$}] at (\i) {};
}
#+end_src

#+begin_src latex :noweb yes
\begin{tikzpicture}
<<pic.十每.1.base>>
\end{tikzpicture}
#+end_src

#+begin_src latex :noweb yes
\begin{solution}

\begin{tikzpicture}
<<pic.十每.1.base>>
\coordinate (E) at (intersection of D--$(C)+($(D)-(B)$)$ and C--A);

\draw [dashed] (C) -- (E) -- (D);

% 标点
\foreach \i/\angle in {E/0} {
  \node[dot, label={[dot label]\angle:$\i$}] at (\i) {};
}

\end{tikzpicture}

\[
  \begin{aligned}
  & \mbox{延长} AC \mbox{至} E, \quad CE=MB, \quad \mbox{连结} ED \\
  & \because \angle MDN = 60 \degree, \angle BDC = 120 \degree \\
  & \therefore \angle DCN = \angle ABD = 90 \degree \\
  & \therefore \angle DCE = 90 \degree \\
  & \mbox{在} \triangle MBD \mbox{和} \triangle DCE \mbox{中} \\
  & \begin{cases}
      & DC = DB \\
      & CE = MB \\
      & \angle DCE = \angle MBD
    \end{cases} \\
  & \therefore \triangle MBD \cong \triangle ECD \\
  & \therefore MD = DE \\
  & \mbox{在} \triangle MDN \mbox{和} \triangle EDN \mbox{中} \\
  & \begin{cases}
      & MD = DE \\
      & DN = DM \\
      & \angle MDN = \angle EDN
    \end{cases} \\
  & \therefore \triangle MDN \cong \triangle EDN \\
  & \therefore MN = BM + NC \\
  & \therefore \triangle AMN \mbox{的周长为} 8
  \end{aligned}
\]
\end{solution}
#+end_src

#+RESULTS:
#+begin_export latex
\begin{solution}

\begin{tikzpicture}
\coordinate (B) at (0, 0);
\coordinate (C) at (2.5, 0);
\coordinate (A) at ($(B)!1!60:(C)$);

\coordinate (D) at (intersection of B--$(B)!2!-30:(C)$
                                 and C--{$(C)!2!30:(B)$});

\coordinate (M) at (intersection of D--$(D)!1!45:(A)$
                                 and A--B);

\coordinate (N) at (intersection of D--$(D)!2!-60:(M)$ and C--A);

% 画线
\draw (A) -- (B) -- (C) -- cycle
(B) -- (D) -- (C)
(D) -- (M) -- (N) -- cycle
;

% 标点
\foreach \i/\angle in {A/90,B/-135,C/-45,D/-90,M/135,N/0} {
  \node[dot, label={[dot label]\angle:$\i$}] at (\i) {};
}
\coordinate (E) at (intersection of D--$(C)+($(D)-(B)$)$ and C--A);

\draw [dashed] (C) -- (E) -- (D);

% 标点
\foreach \i/\angle in {E/0} {
  \node[dot, label={[dot label]\angle:$\i$}] at (\i) {};
}

\end{tikzpicture}

\[
  \begin{aligned}
  & \mbox{延长} AC \mbox{至} E, \quad CE=MB, \quad \mbox{连结} ED \\
  & \because \angle MDN = 60 \degree, \angle BDC = 120 \degree \\
  & \therefore \angle DCN = \angle ABD = 90 \degree \\
  & \therefore \angle DCE = 90 \angle \\
  \end{aligned}
\]
\end{solution}
#+end_export

